<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | Here you may specify custom validation messages for attributes using the
    | convention "attribute.rule" to name the lines. This makes it quick to
    | specify a specific custom language line for a given attribute rule.
    |
    */

    'custom' => [
        'name' => [
            'required' => 'يجب تعبئة حقل الإسم.',
            'string' => 'الإسم يجب أن يكون من نوع بيانات نصية',
            'unique' => 'هذا الإسم موجود مسبقاً بالنظام! الرجاء اختيار اسم آخر.',
            'max' => 'أقصى عدد للحروف المسموح بها هو 225'
        ],
        'email' => [
            'required' => 'يجب تعبئة حقل الإيميل.',
            'string' => 'الإيميل يجب أن يكون من نوع بيانات نصية.',
            'email' => 'صيغة الإيميل غير صحيحة.',
            'max:255' => 'أقصى عدد للحروف المسموح بها هو 225',
            'unique' => 'يوجد حساب مسجل مسبقاً بهذا الإيميل! الرجاء كتابة إيميل آخر.'
        ],
        'phone' => [
            'required' => 'يجب تعبئة حقل الهاتف.',
            'string' => 'الهاتف يجب أن يكون من نوع بيانات نصية.',
            'unique' => 'يوجد حساب مسجل مسبقاً بهذا الهاتف! الرجاء كتابة رقم هاتف آخر.',
            'phone' => 'صيغة رقم الهاتف غير صحيحة! الرجاء التأكد منها ثم إدخال الرقم مرة أخرى.'
        ],
        'address' => [
            'required' => 'يجب تعبئة حقل العنوان.',
        ],
        'description' => [
            'required' => 'يجب تعبئة حقل الوصف.',
            'string' => 'الوصف يجب أن يكون من نوع بيانات نصية.',
            'unique' => 'هذه الميزة موجودة مسبقاً في النظام! الرجاء إدخال ميزة جديدة.',
        ],
        'photo' => [
            'file' => 'الصورة يجب أن تكون من نوع ملف.',
            'mimes:png,jpg,jpeg' => 'الصورة يجب أن تكون بإحدى الصيغ التالية .png, .jpg, .jpeg'
        ],
        'features' => [
            'required' => 'يجب اختيار ميزة واحدة على الأقل.',
            'exists' => 'الميزات المختارة غير موجودة بالنظام.'
        ],
        'price' => [
            'required' => 'يجب تعبئة حقل السعر.',
            'numeric' => 'السعر يجب أن يكون رقماً.'
        ],
        'client' => [
            'required' => 'يجب اختيار عميل.',
            'exists' => 'العميل المختار غير موجود بالنظام.'
        ],
        'package' => [
            'required' => 'يجب اختيار باقة.',
            'exists' => 'الباقة المختارة غير موجودة بالنظام.'
        ],
        'bookingTimes' => [
            'required' => 'يجب إدخال أوقات الحجوزات',
        ],
        'bookingTimes.*.period' => [
            'required' => 'يجب اختيار فترة حجز',
            'in:day,evening' => 'يجب أن تكون الفترة واحدة من القيم التي في القائمة'
        ],
        'bookingTimes.*.from' => [
            'required' => 'يجب تحديد وقت بداية الحجز',
            'date_format:H:i' => 'يجب ادخال صضيغة وقت صحيحة'
        ],
        'bookingTimes.*.to' => [
            'required' => 'يجب تحديد وقت نهاية الحجز',
            'date_format:H:i' => 'يجب ادخال صضيغة وقت صحيحة',
            'after' => 'وقت نهاية الحجز غير صحيح، يجب أن يكون بعد وقت بداية الحجز'
        ],
        'customer.name' => [
            'required' => 'يجب إدخال إسم صاحب الحجز',
        ],
        'customer.email' => [
            'required' => 'يجب إدخال البريد الإلكتروني لصاحب الحجز',
        ],
        'customer.phone' => [
            'required' => 'يجب إدخال هاتف صاحب الحجز',
        ],
        'date' => [
            'required' => 'يجب تعبئة حقل التاريخ',
            'date' => 'يجب أن يكون الحقل من نوع تاريخ'
        ],
        'from' => [
            'required' => 'يجب تعبئة حقل من',
            'date' => 'يجب أن يكون الحقل من نوع تاريخ'
        ],
        'to' => [
            'required' => 'يجب تعبئة حقل إلى',
            'date' => 'يجب أن يكون الحقل من نوع تاريخ',
            'after' => 'تاريخ الحقل إلى يجب أن يكون بعد تاريخ الحقل من'
        ],
        'type' => [
            'required' => 'يجب اختيار النوع',
            'in' => 'يجب أن يكون النوع واحد من الخيارات التي بالقائمة'
        ],
        'discount' => ['numeric' => 'قيمة سعر الخصم يجب أن تكون من نوع رقم'],
        'insurance' => ['numeric' => 'قيمة التأمين يجب أن تكون من نوع رقم'],
        'vat' => [
            'required' => 'يجب تحديد قيمة الضريبة',
            'numeric' => 'قيمة الضريبة يجب أن تكون من نوع رقم'
        ],
        'total' => [
            'required' => 'يجب إدخال إجمالي الحجز',
            'numeric' => 'قيمة الإجمالي يجب أن تكون من نوع رقم',
        ],
        'status' => [
            'required' => 'يجب تحديد حالة الحجز',
            'in' => 'حالة الحجز يجب أن تكون واحدة من الحالات المحددة في قائمة الحالات'
        ],
        'notes' => ['string' => 'الملاحظات يجب أن تكون من نوع بيانات نصية'],
        'client_id' => [
            'required' => 'يجب اختيار عميل',
            'exists' => 'العميل المختار غير موجود في السجلاتنا! الرجاء التأكد ثم الإختيار مرة أخرى'
        ],
        'package_id' => [
            'required' => 'يجب اختيار باقة',
            'exists' => 'الباقة المختارة غير موجودة في سجلاتنا! الرجاء التأكد ثم الإختيار مرة أخرى'
        ],
        'halls' => [
            'required' => 'يجب إضافة قاعات'
        ],
        'halls.*.name' => [
            'required' => 'يجب إدخال إسم القاعة',
            'unique' => 'توجد قاعة أخرى بهذا الإسم! الرجاء إدخال إسم آخر',
            'string' => 'إسم القاعة يجب أن يكون من نوع بيانات نصية'
        ],
        'halls.*.city' => [
            'required' => 'يجب اختيار مدينة من قائمة المدن الموجودة بالإسفل',
            'in' => 'يجب أن تكون المدينة واحدة من المدن المحددة في القائمة',
            'string' => 'المدينة يجب أن تكون من نوع بيانات نصية'
        ],
        'halls.*.address' => [
            'required' => 'يجب إدخال عنوان القاعة',
            'string' => 'العنوان يجب أن يكون من نوع بيانات نصية'
        ],
        'halls.*.capacity' => [
            'required' => 'يجب إدخال سعة القاعة',
            'numeric' => 'يجب أن تكون السعة من نوع رقم',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Attributes
    |--------------------------------------------------------------------------
    |
    | The following language lines are used to swap our attribute placeholder
    | with something more reader friendly such as "E-Mail Address" instead
    | of "email". This simply helps us make our message more expressive.
    |
    */

    'attributes' => [],
];
